"""
日期： 2019年4月29日
题目：输入某年某月某日，判断这一天是这一年的第几天？
思路：遇到整百年时（如2000,1900,300）要被400整除才是闰年,否则为平年（2000闰年,1900平年,300平年）；
    遇到非整百年时（如2004,2005）,只要被4整除就是闰年,不能被4整除为平年（2004闰年,2005平年）；
    闰年的2月有29天,平年的2月有28天.
"""
year = input('请输入年份：')
month = input('请输入月份：')
day = input('请输入天：')
mondic = {'1': 31, '2': 28, '3': 31, '4': 30, '5': 31, '6': 30, '7': 31, '8': 31, '9': 30, '10': 31, '11': 30, '12': 31}
count = int(day)
for i in range(1, int(month)):
    count += mondic[str(i)]
    if int(month) > 2:
        # 对于整百年
        if int(year) % 100 == 0:
            if int(year) % 400 == 0:
                count += 1
        elif int(year) % 4 == 0:
            count += 1
        else:
            print('是平年')
print('这一天是{}年的第{}天'.format(year, count))
